## OpenTofu Enforcement Summary (github)
#### OpenTofu Format and Style: 🖌`success`
#### OpenTofu Initialization: ⚙️`success`
#### OpenTofu Validation: 🤖`success`
#### OpenTofu Plan: 📖`success`

<details><summary>Show Plan</summary>

```

tofu
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
github_actions_organization_permissions.effect_ts: Refreshing state... [id=effect-ts]
github_organization_settings.effect_ts: Refreshing state... [id=77678942]
github_membership.owner["mirepri"]: Refreshing state... [id=Effect-TS:mirepri]
github_membership.owner["gcanti"]: Refreshing state... [id=effect-ts:gcanti]
github_membership.owner["schickling"]: Refreshing state... [id=effect-ts:schickling]
github_membership.owner["mikearnaldi"]: Refreshing state... [id=effect-ts:mikearnaldi]
github_membership.owner["IMax153"]: Refreshing state... [id=effect-ts:IMax153]
github_membership.owner["effect-bot"]: Refreshing state... [id=Effect-TS:effect-bot]
github_membership.owner["fubhy"]: Refreshing state... [id=effect-ts:fubhy]
github_app_installation_repositories.changeset-bot: Refreshing state... [id=35785996]
github_repository_webhook.discord["vite-plugin-react"]: Refreshing state... [id=441502276]
github_repository_webhook.discord["platform"]: Refreshing state... [id=408369606]
github_repository_webhook.discord["data"]: Refreshing state... [id=408369535]
github_repository_webhook.discord["cli"]: Refreshing state... [id=408369518]
github_repository_webhook.discord["build-utils"]: Refreshing state... [id=420771365]
github_repository_webhook.discord["cluster"]: Refreshing state... [id=441502298]
github_repository_webhook.discord["awesome-effect"]: Refreshing state... [id=441502300]
github_repository_webhook.discord["figlet"]: Refreshing state... [id=441502292]
github_repository_webhook.discord["rpc"]: Refreshing state... [id=408369524]
github_repository_webhook.discord["match"]: Refreshing state... [id=408369597]
github_repository_webhook.discord["printer"]: Refreshing state... [id=287965813]
github_repository_webhook.discord["dtslint"]: Refreshing state... [id=416482117]
github_repository_webhook.discord["language-service"]: Refreshing state... [id=408369601]
github_repository_webhook.discord["eslint-plugin"]: Refreshing state... [id=408369602]
github_repository_webhook.discord["discord-bot"]: Refreshing state... [id=414268462]
github_repository_webhook.discord["monorepo-testing"]: Refreshing state... [id=441502306]
github_repository_webhook.discord["io"]: Refreshing state... [id=408369592]
github_repository_webhook.discord["effect"]: Refreshing state... [id=274070787]
github_repository_webhook.discord["codemod"]: Refreshing state... [id=458932936]
github_repository_webhook.discord["experimental"]: Refreshing state... [id=444937657]
github_repository_webhook.discord["cache"]: Refreshing state... [id=408369591]
github_repository_webhook.discord["scala-playground"]: Refreshing state... [id=408369544]
github_repository_webhook.discord["opentelemetry"]: Refreshing state... [id=408369533]
github_repository_webhook.discord["typeclass"]: Refreshing state... [id=421660319]
github_repository_webhook.discord["infra"]: Refreshing state... [id=411554932]
github_repository_webhook.discord[".github"]: Refreshing state... [id=450299462]
github_repository_webhook.discord["test"]: Refreshing state... [id=408369609]
github_repository_webhook.discord["docgen"]: Refreshing state... [id=416482119]
github_repository_webhook.discord["stream"]: Refreshing state... [id=408369575]
github_repository_webhook.discord["website"]: Refreshing state... [id=308394217]
github_repository_webhook.discord["examples"]: Refreshing state... [id=408369557]
github_repository_webhook.discord["schema"]: Refreshing state... [id=408369519]
github_repository_webhook.discord["babel-plugin"]: Refreshing state... [id=408369605]
github_repository_webhook.discord["stm"]: Refreshing state... [id=408369516]
github_membership.member["wesselvdv"]: Refreshing state... [id=effect-ts:wesselvdv]
github_membership.member["DadeSko"]: Refreshing state... [id=Effect-TS:DadeSko]
github_membership.member["0x706b"]: Refreshing state... [id=effect-ts:0x706b]
github_membership.member["tstelzer"]: Refreshing state... [id=effect-ts:tstelzer]
github_membership.member["tim-smart"]: Refreshing state... [id=effect-ts:tim-smart]
github_membership.member["sledorze"]: Refreshing state... [id=effect-ts:sledorze]
github_membership.member["pigoz"]: Refreshing state... [id=effect-ts:pigoz]
github_membership.member["patroza"]: Refreshing state... [id=effect-ts:patroza]
github_membership.member["mattiamanzati"]: Refreshing state... [id=effect-ts:mattiamanzati]
github_membership.member["steida"]: Refreshing state... [id=Effect-TS:steida]
github_membership.member["r-cyr"]: Refreshing state... [id=effect-ts:r-cyr]
github_membership.member["aniravi24"]: Refreshing state... [id=Effect-TS:aniravi24]
github_membership.member["ssalbdivad"]: Refreshing state... [id=Effect-TS:ssalbdivad]
github_membership.member["qlonik"]: Refreshing state... [id=effect-ts:qlonik]
module.github_repository[".github"].github_repository.repository: Refreshing state... [id=.github]
module.github_repository["rpc"].github_repository.repository: Refreshing state... [id=rpc]
module.github_repository["cli"].github_repository.repository: Refreshing state... [id=cli]
module.github_repository["stm"].github_repository.repository: Refreshing state... [id=stm]
module.github_repository["opentelemetry"].github_repository.repository: Refreshing state... [id=opentelemetry]
module.github_repository["language-service"].github_repository.repository: Refreshing state... [id=language-service]
module.github_repository["examples"].github_repository.repository: Refreshing state... [id=examples]
module.github_repository["experimental"].github_repository.repository: Refreshing state... [id=experimental]
module.github_repository["website"].github_repository.repository: Refreshing state... [id=website]
module.github_repository["awesome-effect"].github_repository.repository: Refreshing state... [id=awesome-effect]
module.github_repository["typeclass"].github_repository.repository: Refreshing state... [id=typeclass]
module.github_repository["dtslint"].github_repository.repository: Refreshing state... [id=dtslint]
module.github_repository["babel-plugin"].github_repository.repository: Refreshing state... [id=babel-plugin]
module.github_repository["scala-playground"].github_repository.repository: Refreshing state... [id=scala-playground]
module.github_repository["effect"].github_repository.repository: Refreshing state... [id=effect]
module.github_repository["stream"].github_repository.repository: Refreshing state... [id=stream]
module.github_repository["monorepo-testing"].github_repository.repository: Refreshing state... [id=monorepo-testing]
module.github_repository["data"].github_repository.repository: Refreshing state... [id=data]
module.github_repository["figlet"].github_repository.repository: Refreshing state... [id=figlet]
module.github_repository["cache"].github_repository.repository: Refreshing state... [id=cache]
module.github_repository["infra"].github_repository.repository: Refreshing state... [id=infra]
module.github_repository["vite-plugin-react"].github_repository.repository: Refreshing state... [id=vite-plugin-react]
module.github_repository["match"].github_repository.repository: Refreshing state... [id=match]
module.github_repository["docs-ai"].github_repository.repository: Refreshing state... [id=docs-ai]
module.github_repository["build-utils"].github_repository.repository: Refreshing state... [id=build-utils]
module.github_repository["team"].github_repository.repository: Refreshing state... [id=team]
module.github_repository["io"].github_repository.repository: Refreshing state... [id=io]
module.github_repository["printer"].github_repository.repository: Refreshing state... [id=printer]
module.github_repository["docgen"].github_repository.repository: Refreshing state... [id=docgen]
module.github_repository["platform"].github_repository.repository: Refreshing state... [id=platform]
module.github_repository["eslint-plugin"].github_repository.repository: Refreshing state... [id=eslint-plugin]
module.github_repository["cluster"].github_repository.repository: Refreshing state... [id=cluster]
module.github_repository["discord-bot"].github_repository.repository: Refreshing state... [id=discord-bot]
module.github_repository["test"].github_repository.repository: Refreshing state... [id=test]
module.github_repository["schema"].github_repository.repository: Refreshing state... [id=schema]
module.github_repository["team"].github_branch_default.main: Refreshing state... [id=team]
module.github_repository[".github"].github_branch_default.main: Refreshing state... [id=.github]
module.github_repository["io"].github_branch_default.main: Refreshing state... [id=io]
module.github_repository["data"].github_branch_default.main: Refreshing state... [id=data]
module.github_repository["effect"].github_branch_default.main: Refreshing state... [id=effect]
module.github_repository["schema"].github_branch_default.main: Refreshing state... [id=schema]
module.github_repository["eslint-plugin"].github_branch_default.main: Refreshing state... [id=eslint-plugin]
module.github_repository["cli"].github_branch_default.main: Refreshing state... [id=cli]
module.github_repository["experimental"].github_branch_default.main: Refreshing state... [id=experimental]
module.github_repository["platform"].github_branch_default.main: Refreshing state... [id=platform]
module.github_repository["website"].github_branch_default.main: Refreshing state... [id=website]
module.github_repository["stm"].github_branch_default.main: Refreshing state... [id=stm]
module.github_repository["discord-bot"].github_branch_default.main: Refreshing state... [id=discord-bot]
module.github_repository["figlet"].github_branch_default.main: Refreshing state... [id=figlet]
module.github_repository["build-utils"].github_branch_default.main: Refreshing state... [id=build-utils]
module.github_repository["examples"].github_branch_default.main: Refreshing state... [id=examples]
module.github_repository["cache"].github_branch_default.main: Refreshing state... [id=cache]
module.github_repository["awesome-effect"].github_branch_default.main: Refreshing state... [id=awesome-effect]
module.github_repository["language-service"].github_branch_default.main: Refreshing state... [id=language-service]
module.github_repository["docs-ai"].github_branch_default.main: Refreshing state... [id=docs-ai]
module.github_repository["stream"].github_branch_default.main: Refreshing state... [id=stream]
module.github_repository["vite-plugin-react"].github_branch_default.main: Refreshing state... [id=vite-plugin-react]
module.github_repository["infra"].github_branch_default.main: Refreshing state... [id=infra]
module.github_repository["typeclass"].github_branch_default.main: Refreshing state... [id=typeclass]
module.github_repository["monorepo-testing"].github_branch_default.main: Refreshing state... [id=monorepo-testing]
module.github_repository["opentelemetry"].github_branch_default.main: Refreshing state... [id=opentelemetry]
module.github_repository["printer"].github_branch_default.main: Refreshing state... [id=printer]
module.github_repository["cluster"].github_branch_default.main: Refreshing state... [id=cluster]
module.github_repository["dtslint"].github_branch_default.main: Refreshing state... [id=dtslint]
module.github_repository["docgen"].github_branch_default.main: Refreshing state... [id=docgen]
module.github_repository["match"].github_branch_default.main: Refreshing state... [id=match]
module.github_repository["babel-plugin"].github_branch_default.main: Refreshing state... [id=babel-plugin]
module.github_repository["rpc"].github_branch_default.main: Refreshing state... [id=rpc]
module.github_repository["test"].github_branch_default.main: Refreshing state... [id=test]
module.github_repository["scala-playground"].github_branch_default.main: Refreshing state... [id=scala-playground]
module.github_repository["docgen"].github_repository_collaborators.collaborators: Refreshing state... [id=docgen]
module.github_repository["eslint-plugin"].github_repository_collaborators.collaborators: Refreshing state... [id=eslint-plugin]
module.github_repository["rpc"].github_repository_collaborators.collaborators: Refreshing state... [id=rpc]
module.github_repository["effect"].github_repository_collaborators.collaborators: Refreshing state... [id=effect]
module.github_repository["language-service"].github_repository_collaborators.collaborators: Refreshing state... [id=language-service]
module.github_repository["match"].github_repository_collaborators.collaborators: Refreshing state... [id=match]
module.github_repository["opentelemetry"].github_repository_collaborators.collaborators: Refreshing state... [id=opentelemetry]
module.github_repository["stm"].github_repository_collaborators.collaborators: Refreshing state... [id=stm]
module.github_repository["cache"].github_repository_collaborators.collaborators: Refreshing state... [id=cache]
module.github_repository[".github"].github_repository_collaborators.collaborators: Refreshing state... [id=.github]
module.github_repository["cli"].github_repository_collaborators.collaborators: Refreshing state... [id=cli]
module.github_repository["stream"].github_repository_collaborators.collaborators: Refreshing state... [id=stream]
module.github_repository["monorepo-testing"].github_repository_collaborators.collaborators: Refreshing state... [id=monorepo-testing]
module.github_repository["awesome-effect"].github_repository_collaborators.collaborators: Refreshing state... [id=awesome-effect]
module.github_repository["vite-plugin-react"].github_repository_collaborators.collaborators: Refreshing state... [id=vite-plugin-react]
module.github_repository["typeclass"].github_repository_collaborators.collaborators: Refreshing state... [id=typeclass]
module.github_repository["figlet"].github_repository_collaborators.collaborators: Refreshing state... [id=figlet]
module.github_repository["website"].github_repository_collaborators.collaborators: Refreshing state... [id=website]
module.github_repository["scala-playground"].github_repository_collaborators.collaborators: Refreshing state... [id=scala-playground]
module.github_repository["test"].github_repository_collaborators.collaborators: Refreshing state... [id=test]
module.github_repository["data"].github_repository_collaborators.collaborators: Refreshing state... [id=data]
module.github_repository["dtslint"].github_repository_collaborators.collaborators: Refreshing state... [id=dtslint]
module.github_repository["cluster"].github_repository_collaborators.collaborators: Refreshing state... [id=cluster]
module.github_repository["schema"].github_repository_collaborators.collaborators: Refreshing state... [id=schema]
module.github_repository["io"].github_repository_collaborators.collaborators: Refreshing state... [id=io]
module.github_repository["discord-bot"].github_repository_collaborators.collaborators: Refreshing state... [id=discord-bot]
module.github_repository["platform"].github_repository_collaborators.collaborators: Refreshing state... [id=platform]
module.github_repository["build-utils"].github_repository_collaborators.collaborators: Refreshing state... [id=build-utils]
module.github_repository["docs-ai"].github_repository_collaborators.collaborators: Refreshing state... [id=docs-ai]
module.github_repository["babel-plugin"].github_repository_collaborators.collaborators: Refreshing state... [id=babel-plugin]
module.github_repository["infra"].github_repository_collaborators.collaborators: Refreshing state... [id=infra]
module.github_repository["printer"].github_repository_collaborators.collaborators: Refreshing state... [id=printer]
module.github_repository["experimental"].github_repository_collaborators.collaborators: Refreshing state... [id=experimental]
module.github_repository["team"].github_repository_collaborators.collaborators: Refreshing state... [id=team]
module.github_repository["examples"].github_repository_collaborators.collaborators: Refreshing state... [id=examples]
module.github_repository["platform"].github_branch.main: Refreshing state... [id=platform:main]
module.github_repository["team"].github_branch.main: Refreshing state... [id=team:main]
module.github_repository["cli"].github_branch.main: Refreshing state... [id=cli:main]
module.github_repository["language-service"].github_branch.main: Refreshing state... [id=language-service:main]
module.github_repository["data"].github_branch.main: Refreshing state... [id=data:main]
module.github_repository["examples"].github_branch.main: Refreshing state... [id=examples:main]
module.github_repository["docs-ai"].github_branch.main: Refreshing state... [id=docs-ai:main]
module.github_repository["stm"].github_branch.main: Refreshing state... [id=stm:main]
module.github_repository["typeclass"].github_branch.main: Refreshing state... [id=typeclass:main]
module.github_repository["schema"].github_branch.main: Refreshing state... [id=schema:main]
module.github_repository["stream"].github_branch.main: Refreshing state... [id=stream:main]
module.github_repository["dtslint"].github_branch.main: Refreshing state... [id=dtslint:main]
module.github_repository["effect"].github_branch.main: Refreshing state... [id=effect:main]
module.github_repository["eslint-plugin"].github_branch.main: Refreshing state... [id=eslint-plugin:main]
module.github_repository["infra"].github_branch.main: Refreshing state... [id=infra:main]
module.github_repository["discord-bot"].github_branch.main: Refreshing state... [id=discord-bot:main]
module.github_repository["figlet"].github_branch.main: Refreshing state... [id=figlet:main]
module.github_repository["website"].github_branch.main: Refreshing state... [id=website:main]
module.github_repository["match"].github_branch.main: Refreshing state... [id=match:main]
module.github_repository["test"].github_branch.main: Refreshing state... [id=test:main]
module.github_repository["cluster"].github_branch.main: Refreshing state... [id=cluster:main]
module.github_repository["scala-playground"].github_branch.main: Refreshing state... [id=scala-playground:main]
module.github_repository["cache"].github_branch.main: Refreshing state... [id=cache:main]
module.github_repository["monorepo-testing"].github_branch.main: Refreshing state... [id=monorepo-testing:main]
module.github_repository["babel-plugin"].github_branch.main: Refreshing state... [id=babel-plugin:main]
module.github_repository["printer"].github_branch.main: Refreshing state... [id=printer:main]
module.github_repository["opentelemetry"].github_branch.main: Refreshing state... [id=opentelemetry:main]
module.github_repository["awesome-effect"].github_branch.main: Refreshing state... [id=awesome-effect:main]
module.github_repository["docgen"].github_branch.main: Refreshing state... [id=docgen:main]
module.github_repository["rpc"].github_branch.main: Refreshing state... [id=rpc:main]
module.github_repository["experimental"].github_branch.main: Refreshing state... [id=experimental:main]
module.github_repository[".github"].github_branch.main: Refreshing state... [id=.github:main]
module.github_repository["build-utils"].github_branch.main: Refreshing state... [id=build-utils:main]
module.github_repository["io"].github_branch.main: Refreshing state... [id=io:main]
module.github_repository["vite-plugin-react"].github_branch.main: Refreshing state... [id=vite-plugin-react:main]
module.github_repository["babel-plugin"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIRGSN84CASZX]
module.github_repository["stream"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIhlXv84B9Tvs]
module.github_repository["stm"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIhjYRs4B4CaC]
module.github_repository["effect"].github_branch_protection.rules["next-*"]: Refreshing state... [id=BPR_kwDODTMu2M4CwCSQ]
module.github_repository["language-service"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIVYpPM4B2_af]
module.github_repository["typeclass"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJ0FOXc4CUlY-]
module.github_repository["schema"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIXtsZ84B2sc2]
module.github_repository["dtslint"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJna5_84CQGyc]
module.github_repository["build-utils"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJt_STs4CTySq]
module.github_repository["awesome-effect"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOKZxcwc4Cl8A7]
module.github_repository["infra"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOI8tVi84CMnGU]
module.github_repository["platform"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJJLFUs4CGvjL]
module.github_repository["data"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOILvjzs4B0Bdw]
module.github_repository["test"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIuK6z84B9dhj]
module.github_repository["printer"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOFNoETc4B3LW1]
module.github_repository[".github"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOK8Oqlc4Cse0y]
module.github_repository["match"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOI3PhuM4CCmMQ]
module.github_repository["eslint-plugin"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIl_ml84B5sRj]
module.github_repository["website"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOFakh584CBtty]
module.github_repository["experimental"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOKxTeLc4CoqE8]
module.github_repository["vite-plugin-react"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOKW7aCc4Cl8A8]
module.github_repository["docgen"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJna5984CQGyd]
module.github_repository["cluster"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOKceRP84Cl8A4]
module.github_repository["scala-playground"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOI_LjYs4CKLCe]
module.github_repository["opentelemetry"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJDKLZM4CEm8A]
module.github_repository["discord-bot"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOJbFiIc4COq7l]
module.github_repository["examples"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIf7N2s4CKLCg]
module.github_repository["figlet"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOGgv46c4Cl8A5]
module.github_repository["cli"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOGD6DSs4CHrjM]
module.github_repository["cache"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOGjoBYM4CA5hi]
module.github_repository["effect"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDODTMu2M4CtBcq]
module.github_repository["io"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOITjCX84CI0T_]
module.github_repository["monorepo-testing"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOKiPhUM4CnZkw]
module.github_repository["rpc"].github_branch_protection.rules["main"]: Refreshing state... [id=BPR_kwDOIufVvs4CKLCn]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # github_app_installation_repositories.changeset-bot will be updated in-place
  ~ resource "github_app_installation_repositories" "changeset-bot" {
        id                    = "35785996"
      ~ selected_repositories = [
          + "vscode-extension",
            # (30 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # github_repository_webhook.discord["vscode-extension"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
          + "pull_request",
          + "release",
        ]
      + id         = (known after apply)
      + repository = "vscode-extension"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.github_repository["cluster"].github_repository.repository will be updated in-place
  ~ resource "github_repository" "repository" {
        id                          = "cluster"
        name                        = "cluster"
        # (34 unchanged attributes hidden)

      - pages {
          - build_type = "legacy" -> null
          - custom_404 = false -> null
          - html_url   = "https://effect-ts.github.io/cluster/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/Effect-TS/cluster/pages" -> null

          - source {
              - branch = "main" -> null
              - path   = "/docs" -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.github_repository["codemod"].github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "codemod"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.github_repository["codemod"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "codemod"
    }

  # module.github_repository["codemod"].github_branch_protection.rules["main"] will be created
  + resource "github_branch_protection" "rules" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.github_repository["codemod"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Code mod's for the Effect ecosystem"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + homepage_url                = "https://effect-ts.github.io/codemod"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "codemod"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + pages {
          + build_type = "legacy"
          + custom_404 = (known after apply)
          + html_url   = (known after apply)
          + status     = (known after apply)
          + url        = (known after apply)

          + source {
              + branch = "main"
              + path   = "/docs"
            }
        }
    }

  # module.github_repository["codemod"].github_repository_collaborators.collaborators will be created
  + resource "github_repository_collaborators" "collaborators" {
      + id             = (known after apply)
      + invitation_ids = (known after apply)
      + repository     = "codemod"
    }

  # module.github_repository["vscode-extension"].github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "vscode-extension"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.github_repository["vscode-extension"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "vscode-extension"
    }

  # module.github_repository["vscode-extension"].github_branch_protection.rules["main"] will be created
  + resource "github_branch_protection" "rules" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.github_repository["vscode-extension"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Tools to assist development with the Effect Typescript framework"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "vscode-extension"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false
    }

  # module.github_repository["vscode-extension"].github_repository_collaborators.collaborators will be created
  + resource "github_repository_collaborators" "collaborators" {
      + id             = (known after apply)
      + invitation_ids = (known after apply)
      + repository     = "vscode-extension"
    }

  # module.github_repository["website"].github_branch_protection.rules["main"] will be created
  + resource "github_branch_protection" "rules" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkzNjM0MDU3OTk="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

Plan: 12 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @tim-smart, Action: `pull_request`, Working Directory: `github`, Workflow: `OpenTofu Enforcement`*